# VS Code Extensions
# On personal Mac: code --install-extension <id>
# On work Mac: install via internal Artifactory/marketplace as appropriate

anthropic.claude-code
eamodio.gitlens
github.copilot-chat
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
openai.openai-chatgpt-adhoc
redhat.vscode-yaml
